In [155]:
import pandas as pd
import numpy as np

In [156]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [157]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

QUESTION 1

In [158]:
df['FlightNumber'].interpolate(method='linear',downcast='int64',inplace=True)

In [159]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [160]:
df["FlightNumber"].dtype

dtype('int64')

QUESTION 2

In [161]:
#df1=pd.DataFrame()
df1[['From','To']]=df['From_To'].str.split('_',expand=True)

In [162]:
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [163]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

QUESTION 3

In [164]:
df1.applymap(lambda x: x.capitalize())

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

QUESTION 4

In [165]:
df.drop(columns="From_To",inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [166]:
df=pd.concat([df,df1],axis=1)

In [167]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [168]:
#df.join(df1)

In [169]:
#pd.merge(df,df1,left_index=True,right_index=True)

QUESTION 5

In [170]:
delays=pd.DataFrame([i for i in df['RecentDelays']],columns=["delay_1","delay_2","delay_3"])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [171]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [172]:
df.drop(columns="RecentDelays")

   FlightNumber              Airline      From         To
0         10045               KLM(!)    LoNDon      paris
1         10055    <Air France> (12)    MAdrid      miLAN
2         10065  (British Airways. )    londON  StockhOlm
3         10075       12. Air France  Budapest      PaRis
4         10085          "Swiss Air"  Brussels     londOn

In [173]:
df=df.join(delays)

In [174]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),LoNDon,paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),MAdrid,miLAN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,londOn,67.0,32.0,NaN

In [ ]:
#df=pd.concat([df,delays],axis=1)